In [1]:
import pandas as pd

In [2]:
person = pd.read_csv(r'C:\Users\szinv\Documents\Git_files\bootcamp17\data\pizza\person.csv')

In [4]:
frequents = pd.read_csv(r'C:\Users\szinv\Documents\Git_files\bootcamp17\data\pizza\frequents.csv')

In [6]:
eats=pd.read_csv(r'C:\Users\szinv\Documents\Git_files\bootcamp17\data\pizza\eats.csv')

In [8]:
serves=pd.read_csv(r'C:\Users\szinv\Documents\Git_files\bootcamp17\data\pizza\serves.csv')

In [ ]:
#Part A

In [13]:
teen=person[person.age<=18]

In [15]:
frequents

   name        pizzeria
0   Amy       Pizza Hut
1   Ben   Chicago Pizza
2   Ben       Pizza Hut
3   Cal  New York Pizza
4   Cal       Straw Hat
5   Dan  New York Pizza
6   Dan       Straw Hat
7   Eli   Chicago Pizza
8   Eli       Straw Hat
9   Fay         Dominos
10  Fay  Little Caesars
11  Gus   Chicago Pizza
12  Gus       Pizza Hut
13  Hil         Dominos
14  Hil       Pizza Hut
15  Hil       Straw Hat
16  Ian         Dominos
17  Ian  New York Pizza
18  Ian       Straw Hat

In [18]:
teen_f=pd.merge(teen, frequents)

In [19]:
teen_f

  name  age  gender        pizzeria
0  Amy   16  female       Pizza Hut
1  Dan   13    male  New York Pizza
2  Dan   13    male       Straw Hat
3  Ian   18    male         Dominos
4  Ian   18    male  New York Pizza
5  Ian   18    male       Straw Hat

In [20]:
teen_f_pizz=set(teen_f.pizzeria)

In [21]:
teen_f_pizz

{'Dominos', 'New York Pizza', 'Pizza Hut', 'Straw Hat'}

In [ ]:
#Part B

In [34]:
female=person[person.gender=="female"]

In [35]:
female

  name  age  gender
0  Amy   16  female
5  Fay   21  female
7  Hil   30  female

In [37]:
female_eats=pd.merge(female,eats)

In [44]:
female_peppmush=female_eats[(female_eats.pizza=="mushroom") | (female_eats.pizza=="pepperoni")]

In [71]:
female_peppmush

  name  age  gender      pizza
0  Amy   16  female   mushroom
1  Amy   16  female  pepperoni
2  Fay   21  female   mushroom

In [ ]:
#Part C

In [72]:
female_pepp=female_eats[female_eats.pizza=="pepperoni"]

In [73]:
female_pepp

  name  age  gender      pizza
1  Amy   16  female  pepperoni

In [75]:
female_mush=female_eats[female_eats.pizza=="mushroom"]

In [76]:
female_mush

  name  age  gender     pizza
0  Amy   16  female  mushroom
2  Fay   21  female  mushroom

In [84]:
pd.merge(female_mush, female_pepp, on='name')

  name  age_x gender_x   pizza_x  age_y gender_y    pizza_y
0  Amy     16   female  mushroom     16   female  pepperoni

In [80]:
#Part D

In [96]:
Amy_eats=eats[eats.name=="Amy"]

In [97]:
Amy_eats

  name      pizza
0  Amy   mushroom
1  Amy  pepperoni

In [98]:
lessthan10=serves[serves.price<10]

In [99]:
d_end_data=pd.merge(lessthan10,Amy_eats, on="pizza")

In [100]:
d_end=set(d_end_data.pizzeria)

In [101]:
d_end

{'Little Caesars', 'New York Pizza', 'Straw Hat'}

In [102]:
#Part E

In [120]:
male=person[person.gender=="male"]

In [121]:
male

  name  age gender
1  Ben   21   male
2  Cal   33   male
3  Dan   13   male
4  Eli   45   male
6  Gus   24   male
8  Ian   18   male

In [123]:
freq_male=pd.merge(male,frequents)

In [124]:
freq_female=pd.merge(female,frequents)

In [125]:
freq_female

  name  age  gender        pizzeria
0  Amy   16  female       Pizza Hut
1  Fay   21  female         Dominos
2  Fay   21  female  Little Caesars
3  Hil   30  female         Dominos
4  Hil   30  female       Pizza Hut
5  Hil   30  female       Straw Hat

In [126]:
freq_male

   name  age gender        pizzeria
0   Ben   21   male   Chicago Pizza
1   Ben   21   male       Pizza Hut
2   Cal   33   male  New York Pizza
3   Cal   33   male       Straw Hat
4   Dan   13   male  New York Pizza
5   Dan   13   male       Straw Hat
6   Eli   45   male   Chicago Pizza
7   Eli   45   male       Straw Hat
8   Gus   24   male   Chicago Pizza
9   Gus   24   male       Pizza Hut
10  Ian   18   male         Dominos
11  Ian   18   male  New York Pizza
12  Ian   18   male       Straw Hat